---
kind: type
id: T:Autodesk.Revit.DB.DirectShapeReferencingOption
source: html/6c3c17c6-8b68-27da-aba4-cf62da3ec58c.htm
---
# Autodesk.Revit.DB.DirectShapeReferencingOption

An enumerated type containing possible referencing options for DirectShapes.

## Syntax (C#)
```csharp
public enum DirectShapeReferencingOption
```